routes/web.php

select * from `empresa_clientes` where `empresa_clientes`.`asesor_id` in (1)
select * from `asesores` where `asesores`.`user_id` = 1 and `asesores`.`user_id` is not null
select * from `users` where `users`.`id` = 1 limit 1
select * from `asesores` where `asesores`.`id` = 1 limit 1
select * from `empresa_clientes` where `empresa_clientes`.`id` = 2 limit 1
select * from `usuarios` where `usuarios`.`user_id` = 7 and `usuarios`.`user_id` is not null limit 1
---
    Route::resource('gestion-evaluadores','Clientes\Usuarios\Evaluadores\EvaluadoresController');*/
    //se debe crear el middleware para verificar el rol del usuario

    Route::get('/inicio', function(){
        //si existe se elimina la variable de session
        \App\Http\Controllers\EmpresaClienteController::unsetSessionVariables();
        $user = App\User::find(Auth::user()->id);
        if (Gate::forUser(Auth::user())->allows('verify-Asesor-role')) {
            $asesorUser = $user->asesor;
            foreach ($asesorUser as $value) {
                $idAsesor = $value->id;
            }
            $asesor = App\Asesore::find($idAsesor);
            $empresaAsesor = $asesor->empresaAsesor;
            $empresasCliente = $asesor->empresasCliente;
            return view('analissta.inicioAsesor')->with(['datosEmpresa'=>$empresaAsesor,'empresasCliente'=>$empresasCliente]);
        }

        $empresaCliente = App\Usuario::find($user->usuario()->first()->id)->empresaCliente;
        //return view('analissta.inicioCliente')->with('datosEmpresa',$empresaCliente);
        return redirect()->route('ver-empresa-cliente',['id'=>$empresaCliente->id]);
    })->name('inicio');