app/Http/Controllers/MedidasIntervencion/ActividadesCalendarioController.php

select * from `actividades_calendarios` where `sistema_id` = 2 and `anio` = '2019' and `mes` = 'Mayo' and `semana` = '2'
---
    public function calendarioSemanalActividad($mes, $semana){
        $actividades = ActividadesCalendario::where('sistema_id',session('sistema')->id)
            ->where('anio', helpers::getCurrentYear())
            ->where('mes',$mes)
            ->where('semana',$semana)
            ->get();