app/Http/Controllers/MedidasIntervencion/ActividadesController.php

select * from `actividades_valoraciones` where `id` = '157' and `sistema_id` = 2
---
    private function getObjetoActividad($id,$tipo){

        switch ($tipo) {
            case ($tipo === 'obligatoria' || $tipo === 'sugerida'):

                $actividad = ActividadesObligatoriasSugerida::where('id',$id)
                        ->where('sistema_id',session('sistema')->id)
                        ->where('medida',$tipo)
                        ->get();
                break;
            case 'valoracion':
                $actividad = ActividadesValoracione::where('id',$id)
                        ->where('sistema_id',session('sistema')->id)
                        ->get();