app/Http/Controllers/MedidasIntervencion/ActividadesValoracionController.php

select * from `actividades_valoraciones` where `id` = '157' and `sistema_id` = 2
---
    public function verActividad($id){
        $actividad = ActividadesValoracione::where('id',$id)
                        ->where('sistema_id',session('sistema')->id)
                        ->get();

select * from `actividades_valoraciones` where `id` = '157' and `sistema_id` = 2
---
    private function getActividad($id){
        $actividad = ActividadesValoracione::where('id',$id)
                ->where('sistema_id',session('sistema')->id)
                ->get();

update `actividades_valoraciones` set `cargo` = 'asdasd', `evidencias` = 'asdasd', `observaciones` = 'asdasd', `updated_at` = '2019-02-14 21:36:10' where `id` = '157' and `sistema_id` = 2
---
    public function updateDatosGenerales($data){

        ActividadesValoracione::where('id',$data["idActividad"])
                ->where('sistema_id',session('sistema')->id)
                ->update([
                    'cargo'         => $data["cargo"],
                    'evidencias'    => $data["evidencias"],
                    'observaciones'    => $data["observaciones"],
                ]);

delete from `actividades_calendarios` where `sistema_id` = 2 and `actividad_id` = '157' and `tipo` = 'valoracion' and `anio` = '2019'
update `actividades_valoraciones` set `frecuencia` = 'quincenal', `estado` = '', `ejecucionTotal` = 0, `updated_at` = '2019-02-14 16:37:19' where `id` = '157' and `sistema_id` = 2
---
    public function crearProgramacionActividad($data){
        $newArr = array_chunk($data["dataCentros"], 4);
        ActividadesCalendario::where('sistema_id',session('sistema')->id)
                ->where('actividad_id',$data["idActividad"])
                ->where('tipo','valoracion')
                ->where('anio',helpers::getCurrentYear())
                ->delete();

        ActividadesValoracione::where('id',$data["idActividad"])
                ->where('sistema_id',session('sistema')->id)
                ->update([
                    'frecuencia'    => $data["frecuencia"],
                    'estado'         => '',
                    'ejecucionTotal' => 0
                ]);

update `actividades_valoraciones` set `estado` = 'Programada', `updated_at` = '2019-02-14 21:37:36' where `id` = '157' and `sistema_id` = 2
---
    public function finalizarProgramacionActividad($id){
        ActividadesValoracione::where('id',$id)
                ->where('sistema_id',session('sistema')->id)
                ->update([
                    'estado'    => 'Programada',
                ]);