app/Http/Controllers/Comunidad/ComunidadProfesionalesController.php

    public function index()
    {
        $profesionales = ComunidadProfesionale::all();
---
select * from `comunidad_profesionales`

    public function destroy($id)
    {
        if(ComunidadProfesionale::find($id)){
            ComunidadProfesionale::find($id)->delete();
---
select * from `comunidad_profesionales` where `comunidad_profesionales`.`id` = '10' limit 1
delete from `comunidad_profesionales` where `id` = 10