app/Http/Controllers/Comunidad/ComunidadAnalisstaController.php

select * from `comunidad_profesionales`
select * from `comunidad_empresas`
select * from `comunidad_invitados`
---
    public function index()
    {
        $profesionales = ComunidadProfesionale::all();
        $empresas = ComunidadEmpresa::all();
        $invitados = ComunidadInvitado::all();