app/Http/Controllers/EmpleadoController.php

    public function buscarEmpleado($q){
        $empleadosEmpresa = Empleado::where('empresaCliente_id',session('idEmpresaCliente'))->get();
---
select * from `empleados` where `empresaCliente_id` = 2

    public function cargarDatosEmpleado($id){
        $empleado = Empleado::where(['identificacion'=>$id,'empresaCliente_id'=>session('idEmpresaCliente')])->get();
---
select * from `empleados` where (`identificacion` = '53119364' and `empresaCliente_id` = 2)

    public function eliminarEmpleado($id){
        $empleado = Empleado::find($id);
        $empleado->delete();
        $usuario = Usuario::where('empleados_id',$id)->get();
        if(isset($usuario[0]->id)){
            $user = User::find($usuario[0]->user_id);
            $user->delete();
            $usuario->delete();
---
select * from `empleados` where `empleados`.`id` = '21' limit 1
select * from `usuarios` where `usuarios`.`empleados_id` = 21 and `usuarios`.`empleados_id` is not null limit 1
select * from `users` where `users`.`id` = 5 limit 1
delete from `users` where `id` = 5
delete from `usuarios` where `id` = 3
delete from `empleados` where `id` = 21