app/Http/Controllers/EmpresaClienteController.php

select * from `empresa_clientes` where `empresa_clientes`.`id` = '2' limit 1
select * from `usuarios` where `usuarios`.`empresaCliente_id` in (2)
---
    public function cargarPaginaEmpresa($id){

        if (session('sistema')!==null) {
            session()->forget('sistema');
        }

        $empresa = EmpresaCliente::find($id);
        session(['idEmpresaCliente'=>$empresa->id]);
        return view('analissta.empresa');
    }

    /*public function paginaPrincipalEmpresa($idUsuario){
        $datosEmpresa = App\Usuario::find($idUsuario)->empresaCliente;