app/Http/Controllers/helpers.php

select * from `users` where `users`.`id` = 1 limit 1
select * from `asesores` where `asesores`.`id` = 1 limit 1
select * from `empresa_clientes` where `empresa_clientes`.`id` = 2 limit 1
select * from `usuarios` where `usuarios`.`id` = 5 limit 1
---
    public static function getAsesor(){
        $user = \App\User::find(Auth::user()->id);
        if (Gate::forUser(Auth::user())->allows('verify-Asesor-role')) {
            $asesorUser = $user->asesor;
            foreach ($asesorUser as $value) {
                $idAsesor = $value->id;
            }
            $asesor = Asesore::find($idAsesor);
            $empresaUsuarioConectado = $asesor->empresaAsesor;
        }else{
            $usuarioUser = $user->usuario;
            foreach ($usuarioUser as $value) {
                $idUsuario = $value->id;
            }
            $empresaUsuarioConectado = Usuario::find($idUsuario)->empresaCliente;