app/Http/Controllers/UsuarioController.php

select * from `empleados` where `identificacion` = '45578898' limit 1
---
    public function crearNuevoUsuario(){
        $data = request()->validate([
            'nombres'       => 'string|required',
            'apellidos'     => 'string|required',
            'identificacion'=> 'string|required', // va a ser el password Inicial
            'email'         => 'email|required|unique:users',
            'telefono'      => 'string|required',
            'roleUsuario'   => 'string|required', //|enum:[Administrador, Digitador]
        ],[
            'nombres.required'          => 'Debe ingresar los nombres del empleado',
            'apellidos.required'        => 'Debe ingresar los apellidos del empleado',
            'identificacion.required'   => 'Debe ingresar el número de identificación del empleado',
            'email.required'            => 'Debe ingresar un email',
            'telefono.required'         => 'Debe ingresar un número de teléfono',

            'email.unique'          => 'Ya existe un usuario con este email',
        ]);
        $empleado = Empleado::where('identificacion', $data["identificacion"])->first();

select * from `usuarios` where `usuarios`.`id` = '4' limit 1
select * from `users` where `users`.`id` = 6 limit 1
delete from `users` where `id` = 3
delete from `usuarios` where `id` = 1
---
    public function eliminarUsuario($id){
        $usuario = Usuario::find($id);
        $user = User::find($usuario->user_id);
        $user->delete();
        $usuario->delete();