app/Providers/AppServiceProvider.php

    public function boot()
    {
        Schema::defaultStringLength(191);

        View::composer('*',function($view){
            $empresa=$sistema=$datosEmpresa=null;
            if(Auth::user()){
                $datosEmpresa = helpers::getAsesor();
            }
            if(session('idEmpresaCliente')){

                $empresa = EmpresaCliente::find(session('idEmpresaCliente'));
            }

            if(session('sistema')!==null){
                $sistema = Sistema::find(session('sistema')->id);
---
select * from `empresa_clientes` where `empresa_clientes`.`id` = 1 limit 1
select * from `sistemas` where `sistemas`.`id` = 2 limit 1